[
  {
    "id": 1,
    "title": "Islamic Conference 2026",
    "date": "2026-02-10",
    "time": "10:00 AM",
    "location": "Dhaka Convention Center",
    "description": "Annual Islamic conference bringing together scholars and leaders",
    "content": "Join us for our annual Islamic conference where we discuss contemporary issues facing Muslim communities worldwide. Expert speakers will share insights on education, technology, and social welfare.",
    "image": "/assets/event-01.jpg",
    "featured": true,
    "enabled": true,
    "status": "upcoming",
    "priority": "low",
    "capacity": 500,
    "registered": 234,
    "category": "conference"
  },
  {
    "id": 2,
    "title": "Youth Workshop Series",
    "date": "2026-01-25",
    "time": "2:00 PM",
    "location": "ATR Innovation Hub",
    "description": "Interactive workshop for young professionals on technology and entrepreneurship",
    "content": "Learn cutting-edge skills in web development, digital marketing, and business management from industry experts.",
    "image": "/assets/event-02.jpg",
    "featured": true,
    "enabled": true,
    "status": "upcoming",
    "priority": "mid",
    "capacity": 100,
    "registered": 87,
    "category": "workshop"
  },
  {
    "id": 3,
    "title": "Quran Meaning Recitation Competition at Dhaka University 2023",
    "date": "2023-12-08",
    "time": "10:00 AM",
    "location": "Dhaka University",
    "description": "Quran Meaning Recitation Competition Event",
    "content": "S.M. Maruf Hasan (Nirab)\nCo-ordinator\nAl Quran Meaning Recitation Competition\nStudent, Dhaka University\n\nThe history of Islamic education in our country is quite old. However, currently, we receive the primary lessons of Islam in a very small scope. That too is very minimal for school-college students. My educational life passed in school and college, then in university, accordingly, I received the primary education of Islam from family and primary school Islamic education books. The education of Maktab in childhood also played a big role in my life in knowing Islam. However, the main role in practicing Islam in my life has been my self-study and organizing various Islam-centric competitions. One of those events is the 'Quran Recitation with Meaning Competition' organized by QARI. In Ramadan 2023, I participated in the event, this two-month event helped me to read and understand the complete Quran with meaning. Moreover, the sincerity of the organizers and their care in taking daily updates on studies impressed me.\n\n2015. I entered university life, a different reality began. A reality different from all previous realities. Among the realities like dormitory, guest room, ragging culture, etc., there is an adverse environment for Islamic practice. Although I was quite overwhelmed at first, I continued to try to adapt gradually. In this way, four years passed in the university. In the meantime, the horror of Corona started, the campus closed, I came home. As the days passed, the horror of Corona increased. After participating in QARI's event in Ramadan, I thought about starting Quran recitation event in the university. One day I discussed with a senior brother of the university and a teacher about the Quran meaning recitation event. They also advised to start the event. After that, I took Rafiq Bhai's advice, discussed via WhatsApp. I had no prior acquaintance with Rafiq Bhai. By the grace of the Almighty, through the Quran recitation event, I got acquainted with a very good-natured person. After long discussions, the virtual event started in September. We started the event under the banner of United Muslim Ummah organization. Initially, we thought maybe very few participants would join the event. So preparations were made on a very small scale. But gradually, the registered participants reached almost 1200. So the workload also increased. During Corona lockdown, sitting at home with long time, there was no problem in working because there was no academic or other busyness, although father was quite ill. But from the beginning, Rafiq Bhai has helped in various ways by giving advice. Posting on WhatsApp and Facebook groups, taking everyone's updates, mailing everyone, and regular Quran recitation passed the first three months of Corona lockdown, Alhamdulillah.\nIn the two-month event, many new experiences were gained, discussions about the event were held with many people. Discussions were held with several teachers of the university, and they advised to keep the event ongoing. The participants especially encouraged about the event, their advice and enthusiasm for Quran recitation made the daily work easier. Thus the two months of the competition ended, during which about 300 participants completed the meaning recitation. For those who could not complete the reading, one more month was extended. Finally, about 450 participants completed the Quran meaning recitation. After that, an online exam was taken by QARI on their behalf, through which gifts were delivered by courier to twelve participants with the highest marks.\n\nAt this stage, delivering gifts to all who completed the recitation was a big responsibility, and this work was not possible alone in any way. So in the virtual meeting of United Muslim Ummah and QARI, it was decided that after the campus opens, gifts will be delivered to everyone through an event. Alhamdulillah, on December 8, 2024, that event was completed. Through that program, we got countless well-wishers whose cooperation made it possible to successfully complete the event. May everyone be able to realize the essence of the Quran and highlight the importance of Quran recitation among their own neighborhoods, localities, and juniors.\nOn November 29, 2023, my father passed away during this Quran recitation event (request for prayers for father to everyone). From my childhood, my father gave the utmost importance to Quran education. And that education had become a tree before father's death, perhaps that's why I was able to complete the Quran recitation journey of three long months with about 450 participants from the campus. In the work, Rafiq Bhai and Rezwan Salehin Bhai helped a lot. With their sincere cooperation, we were able to complete this journey of Quran recitation.\n\nFrom three long months of regular Quran recitation, participants' feelings, emotions, and love, it has been realized that if we all take initiative together, it is possible to start such events in all universities, and through this, we will get the opportunity to learn Islam from the main book of Islam, Al Quran. Through this, we can gradually move from the path of division to the path of unity. Therefore, the request to everyone is to understand the Quran and at the same time take others along to realize the essence of the Quran. Only by taking initiative, we all can realize the essence of the great book Al Quran. And in this work, we should compete because Allah Subhanahu Ta'ala said in verse 148 of Surah Baqarah: 'Compete in good deeds'.\n\nHonorable VC Sir Professor Akhtaruzzaman participated in the event\n\nMd. Rafiq Bhai, Director QARI is speaking in the event\n\n\n\n\n\n\n\n\nSome glimpses of prize distribution among participants\n\nBenjamin Sorensen, a follower of Christianity, is expressing his feelings about Quran recitation\n\nAdditional highlights from 2023 event:\n- Increased participation with over 600 active participants\n- Introduction of digital tracking system for daily progress\n- Collaboration with international Islamic scholars for virtual sessions\n- Special focus on youth engagement and modern technology integration\n- Establishment of permanent Quran study groups in universities",
    "image": "/assets/gallery-0168.jpeg",
    "featured": false,
    "enabled": true,
    "status": "completed",
    "priority": "low",
    "capacity": 600,
    "registered": 600,
    "category": "education"
  },
  {
    "id": 4,
    "title": "Quran Meaning Recitation Competition at Dhaka University 2020",
    "date": "2020-12-08",
    "time": "10:00 AM",
    "location": "Dhaka University",
    "description": "Quran Meaning Recitation Competition Event",
    "content": "S.M. Maruf Hasan (Nirab)\nCo-ordinator\nAl Quran Meaning Recitation Competition\nStudent, Dhaka University\n\nThe history of Islamic education in our country is quite old. However, currently, we receive the primary lessons of Islam in a very small scope. That too is very minimal for school-college students. My educational life passed in school and college, then in university, accordingly, I received the primary education of Islam from family and primary school Islamic education books. The education of Maktab in childhood also played a big role in my life in knowing Islam. However, the main role in practicing Islam in my life has been my self-study and organizing various Islam-centric competitions. One of those events is the 'Quran Recitation with Meaning Competition' organized by QARI. In Ramadan 2020, I participated in the event, this two-month event helped me to read and understand the complete Quran with meaning. Moreover, the sincerity of the organizers and their care in taking daily updates on studies impressed me.\n\n2015. I entered university life, a different reality began. A reality different from all previous realities. Among the realities like dormitory, guest room, ragging culture, etc., there is an adverse environment for Islamic practice. Although I was quite overwhelmed at first, I continued to try to adapt gradually. In this way, four years passed in the university. In the meantime, the horror of Corona started, the campus closed, I came home. As the days passed, the horror of Corona increased. After participating in QARI's event in Ramadan, I thought about starting Quran recitation event in the university. One day I discussed with a senior brother of the university and a teacher about the Quran meaning recitation event. They also advised to start the event. After that, I took Rafiq Bhai's advice, discussed via WhatsApp. I had no prior acquaintance with Rafiq Bhai. By the grace of the Almighty, through the Quran recitation event, I got acquainted with a very good-natured person. After long discussions, the virtual event started in September. We started the event under the banner of United Muslim Ummah organization. Initially, we thought maybe very few participants would join the event. So preparations were made on a very small scale. But gradually, the registered participants reached almost 1200. So the workload also increased. During Corona lockdown, sitting at home with long time, there was no problem in working because there was no academic or other busyness, although father was quite ill. But from the beginning, Rafiq Bhai has helped in various ways by giving advice. Posting on WhatsApp and Facebook groups, taking everyone's updates, mailing everyone, and regular Quran recitation passed the first three months of Corona lockdown, Alhamdulillah.\nIn the two-month event, many new experiences were gained, discussions about the event were held with many people. Discussions were held with several teachers of the university, and they advised to keep the event ongoing. The participants especially encouraged about the event, their advice and enthusiasm for Quran recitation made the daily work easier. Thus the two months of the competition ended, during which about 300 participants completed the meaning recitation. For those who could not complete the reading, one more month was extended. Finally, about 450 participants completed the Quran meaning recitation. After that, an online exam was taken by QARI on their behalf, through which gifts were delivered by courier to twelve participants with the highest marks.\n\nAt this stage, delivering gifts to all who completed the recitation was a big responsibility, and this work was not possible alone in any way. So in the virtual meeting of United Muslim Ummah and QARI, it was decided that after the campus opens, gifts will be delivered to everyone through an event. Alhamdulillah, on December 8, 2021, that event was completed. Through that program, we got countless well-wishers whose cooperation made it possible to successfully complete the event. May everyone be able to realize the essence of the Quran and highlight the importance of Quran recitation among their own neighborhoods, localities, and juniors.\nOn November 29, 2020, my father passed away during this Quran recitation event (request for prayers for father to everyone). From my childhood, my father gave the utmost importance to Quran education. And that education had become a tree before father's death, perhaps that's why I was able to complete the Quran recitation journey of three long months with about 450 participants from the campus. In the work, Rafiq Bhai and Rezwan Salehin Bhai helped a lot. With their sincere cooperation, we were able to complete this journey of Quran recitation.\n\nFrom three long months of regular Quran recitation, participants' feelings, emotions, and love, it has been realized that if we all take initiative together, it is possible to start such events in all universities, and through this, we will get the opportunity to learn Islam from the main book of Islam, Al Quran. Through this, we can gradually move from the path of division to the path of unity. Therefore, the request to everyone is to understand the Quran and at the same time take others along to realize the essence of the Quran. Only by taking initiative, we all can realize the essence of the great book Al Quran. And in this work, we should compete because Allah Subhanahu Ta'ala said in verse 148 of Surah Baqarah: 'Compete in good deeds'.\n\nHonorable VC Sir Professor Akhtaruzzaman participated in the event\n\nMd. Rafiq Bhai, Director QARI is speaking in the event\n\n\n\n\n\n\n\n\nSome glimpses of prize distribution among participants\n\nBenjamin Sorensen, a follower of Christianity, is expressing his feelings about Quran recitation",
    "image": "/assets/gallery-0166.jpeg",
    "featured": false,
    "enabled": true,
    "status": "completed",
    "priority": "low",
    "capacity": 450,
    "registered": 450,
    "category": "education"
  },
  {
    "id": 5,
    "title": "Qur'an Recitation Competition",
    "date": "2026-01-26",
    "time": "10:00 AM",
    "location": "Dhaka Convention Center",
    "description": "The Moral Impact of the 'Al-Qur'an Meaning-Based Reading Competition' Behind the Victory of DUCSU Leaders - A transformative initiative fostering ethical awareness and leadership among young minds.",
    "content": "The Moral Impact of the 'Al-Qur'an Meaning-Based Reading Competition' Behind the Victory of DUCSU Leaders<br/><br/>Dhaka University Correspondent:<br/><br/>In the recent Dhaka University Central Students' Union (DUCSU) election, several victorious student leaders have identified the 'Al-Qur'an Meaning-Based Reading Competition' as a key source of their intellectual growth, moral development, and inner self-reflection. This initiative—religious in nature yet deeply contemplative—has drawn attention for its role in nurturing ethical awareness and a sense of responsibility among young people.<br/><br/>Analysts believe that such programs at the university level not only enhance religious understanding but also prepare students for social and political responsibility.<br/><br/><strong>Qur'anic Message and the Sense of Leadership</strong><br/><br/>One of the key organizers of the Al-Qur'an Meaning-Based Reading Competition stated:<br/><br/>'Our aim was not merely for students to recite the Qur'an, but to understand its meanings and messages. Because for leadership, the most essential qualities are ethical thinking and self-discipline.'<br/><br/>Students and teachers from various higher educational institutions across the country—including the University of Dhaka, BUET, and Dhaka Medical College—participated in the competition. According to the organizers, participants were encouraged to explore the connection between Qur'anic principles and real-life challenges.<br/><br/>A participating student shared:<br/><br/>'To engage in politics or leadership, one must have a strong ideological foundation. This competition taught me that leadership means a spirit of service, standing against injustice, and working for the welfare of humanity.'<br/><br/><strong>The Connection Between Thought, Ethics, and Inner Awakening</strong><br/><br/>A section of the university's academic community believes that the Al-Qur'an Meaning-Based Reading Competition has contributed significantly to moral practice and inner awakening among students.<br/><br/>A faculty member from the Department of Islamic History and Culture at the University of Dhaka commented:<br/><br/>'A generation that understands religion thoughtfully tends to play a responsible role in society. The emergence of such students in DUCSU leadership signals a positive change.'<br/><br/>Observations among students suggest that the competition has helped cultivate discipline, empathy, and sound decision-making skills. Even in a politically turbulent environment, students are showing growing interest in practicing value-based leadership.<br/><br/><strong>Moral Direction for a New Generation</strong><br/><br/>Many university teachers and alumni believe that the Al-Qur'an Meaning-Based Reading Competition has provided a new moral and intellectual direction for young people. It has evolved beyond a purely religious activity into a training ground for principled leadership.<br/><br/>In this context, several DUCSU election winners have openly acknowledged that their experiences in various competitions and initiatives organized by non-political organizations—such as United Muslim Ummah, Dawah Association, and Dawah Circle—have strengthened their confidence, reasoning ability, and moral values.<br/><br/><strong>Conclusion</strong><br/><br/>For a long time, DUCSU elections were synonymous with political tension, conflict, and intense rivalry. However, the changes observed in recent times may be rooted in such ethical and contemplative initiatives.<br/><br/>While the Al-Qur'an Meaning-Based Reading Competition may not be a center of political influence, its light has illuminated the hearts of many young leaders igniting the lamp of justice, ideals, and morality within them.",
    "image": "/assets/Quran compt.png.webp",
    "featured": true,
    "enabled": true,
    "status": "ongoing",
    "priority": "high",
    "capacity": 300,
    "registered": 150,
    "category": "competition"
  },
  {
    "id": 6,
    "title": "Palestine Program",
    "date": "2025-12-15",
    "time": "6:00 PM",
    "location": "Community Hall",
    "description": "Educational program raising awareness about Palestine and supporting humanitarian efforts",
    "content": "An informative session about the current situation in Palestine, featuring guest speakers, documentaries, and fundraising for humanitarian aid.",
    "image": "/assets/gallery-068.jpg",
    "featured": false,
    "enabled": true,
    "status": "previous",
    "priority": "mid",
    "capacity": 200,
    "registered": 180,
    "category": "educational"
  },
  {
    "id": 7,
    "title": "Islamic Conference",
    "date": "2025-11-20",
    "time": "9:00 AM",
    "location": "Grand Ballroom",
    "description": "Annual Islamic conference discussing contemporary issues and solutions",
    "content": "Scholars and community leaders gathered to discuss pressing issues facing Muslim communities worldwide, including education, social welfare, and technological advancement.",
    "image": "/assets/gallery-070.jpg",
    "featured": true,
    "enabled": true,
    "status": "previous",
    "priority": "high",
    "capacity": 500,
    "registered": 450,
    "category": "conference"
  },
  {
    "id": 8,
    "title": "Ummah Cultural Centre",
    "date": "2025-10-10",
    "time": "2:00 PM",
    "location": "Cultural Centre",
    "description": "Opening ceremony of the new Ummah Cultural Centre facility",
    "content": "Celebrating the inauguration of our new cultural centre with traditional performances, exhibitions, and community gatherings.",
    "image": "/assets/gallery-0138.jpg",
    "featured": false,
    "enabled": true,
    "status": "previous",
    "priority": "mid",
    "capacity": 400,
    "registered": 350,
    "category": "cultural"
  },
  {
    "id": 9,
    "title": "Ummah Library",
    "date": "2025-09-05",
    "time": "11:00 AM",
    "location": "Library Building",
    "description": "Grand opening of the Ummah Library with extensive Islamic literature collection",
    "content": "The new library features thousands of books on Islamic studies, history, and contemporary issues, available for community members.",
    "image": "/assets/event-02.jpg",
    "featured": false,
    "enabled": true,
    "status": "previous",
    "priority": "low",
    "capacity": 150,
    "registered": 120,
    "category": "educational"
  },
  {
    "id": 10,
    "title": "Ummah Scholarship Program",
    "date": "2025-08-15",
    "time": "4:00 PM",
    "location": "Education Centre",
    "description": "Announcement and distribution of scholarships for deserving students",
    "content": "Recognizing academic excellence and providing financial support for students pursuing Islamic education and related fields.",
    "image": "/assets/event-03.jpg",
    "featured": false,
    "enabled": true,
    "status": "previous",
    "priority": "mid",
    "capacity": 100,
    "registered": 80,
    "category": "educational"
  },
  {
    "id": 11,
    "title": "Al-Qur'an Distribution Program",
    "date": "2025-07-20",
    "time": "10:00 AM",
    "location": "Mosque Premises",
    "description": "Mass distribution of Al-Qur'an copies to community members",
    "content": "Providing free copies of the Holy Qur'an to households and individuals, ensuring accessibility to Islamic teachings.",
    "image": "/assets/gallery-031.jpg",
    "featured": false,
    "enabled": true,
    "status": "previous",
    "priority": "low",
    "capacity": 250,
    "registered": 200,
    "category": "religious"
  },
  {
    "id": 12,
    "title": "Bangladesh Halal Expo - 2026",
    "date": "2026-05-07",
    "time": "7-9 May 2026",
    "location": "China Bangladesh Friendship Conference Center",
    "description": "Principal Organizer & Host: United Muslim Ummah Foundation. Venue: Bangladesh China Friendship Conference Center. Date: 7–8–9th of May 2026. Meeting Point of the Global Halal Economy - The largest international trade fair for halal products and services.",
    "content": "Bangladesh Halal Expo 2026 stands as a trusted meeting point of the global halal economy, bringing together international exhibitors, buyers, innovators, and policymakers on one prestigious platform. Guided by the principles of halal, ethical trade, and sustainability, the Expo reflects a shared vision of inclusive growth and responsible commerce.<br/><div class='card about-highlights-card'><h4 style='color: var(--primary-green); margin-bottom: 15px; font-size: 1.4rem;'>2026 Highlights</h4><ul style='list-style: none'><li style='margin-bottom: 15px; display: flex; align-items: center'><span style='color: var(--gold); margin-right: 10px; font-size: 1.2rem;'>✓</span>15,000+ sqm International Exhibition Area</li><li style='margin-bottom: 15px; display: flex; align-items: center'><span style='color: var(--gold); margin-right: 10px; font-size: 1.2rem;'>✓</span>Participation from 40+ Countries</li><li style='margin-bottom: 15px; display: flex; align-items: center'><span style='color: var(--gold); margin-right: 10px; font-size: 1.2rem;'>✓</span>700+ Hosted International Buyers</li><li style='margin-bottom: 15px; display: flex; align-items: center'><span style='color: var(--gold); margin-right: 10px; font-size: 1.2rem;'>✓</span>Organized in collaboration with OIC-affiliated Institutions</li><li style='margin-bottom: 15px; display: flex; align-items: center'><span style='color: var(--gold); margin-right: 10px; font-size: 1.2rem;'>✓</span>Specialized Zones: NOV, Private Label &amp; SEFPEX</li><li style='margin-bottom: 15px; display: flex; align-items: center'><span style='color: var(--gold); margin-right: 10px; font-size: 1.2rem;'>✓</span>Platform for Global B2B Meetings &amp; Halal Trade Forums</li></ul></div>",
    "image": "/assets/halal_expo.png",
    "featured": true,
    "enabled": true,
    "status": "upcoming",
    "priority": "high",
    "capacity": 150,
    "registered": 98,
    "category": "networking",
    "pdf": "/documents/halal-expo-2026.pdf"
  }
]
