[
  {
    "id": 1,
    "title": "Palestine Webinar Series Launched to Discuss Background of the Palestine Conflict",
    "date": "2026-01-28",
    "author": "United Muslim Ummah",
    "summary": "A Palestine Webinar Series has been launched with the aim of raising awareness and providing historical and contemporary insights into the Palestine conflict",
    "content": "A Palestine Webinar Series has been launched with the aim of raising awareness and providing historical and contemporary insights into the Palestine conflict. The first episode of the series, titled 'Background of the Palestine Conflict & Palestine Today,' will be held live on Friday, 18th June at 7:30 PM via Facebook Live.\n\nThe keynote speaker of the session is Nurul Huda Habib, a scholar of Arabic and Islamic Studies. He holds a BA and MA in Arabic from Rajshahi University, and an MA in Islamic Studies (Islam in Europe) from the University of Sarajevo, Bosnia, where he is also serving as a Research Fellow. His academic background and research experience are expected to add depth and clarity to the discussion.\n\nThe webinar will be hosted by Munayem Bin Mujib, who will moderate the session and facilitate interaction with the audience. The program aims to present an academic, historical, and ethical understanding of the Palestine issue, highlighting both its roots and current realities.\n\nThe event will be streamed live on www.facebook.com/UMUYN, allowing viewers from around the world to participate. Organizers hope the webinar series will contribute to informed dialogue and greater global awareness regarding Palestine.",
    "image": "/assets/news-01.jpg",
    "featured": true,
    "enabled": true,
    "category": "education",
    "views": 1800,
    "likes": 450
  },
  {
    "id": 2,
    "title": "Webinar on the Role of Youth in Responding to the Challenges of the Ummah to Be Held",
    "date": "2026-01-28",
    "author": "United Muslim Ummah Youth Network",
    "summary": "A webinar titled 'The Role of Youth in Responding to the Challenges of the Ummah' is set to be held with the objective of inspiring young Muslims",
    "content": "A webinar titled 'The Role of Youth in Responding to the Challenges of the Ummah' is set to be held with the objective of inspiring young Muslims to understand their responsibilities toward the Muslim Ummah in the contemporary world.\n\nThe webinar will take place on Friday, 26 June at 8:00 PM and will be streamed live on Facebook.\n\nThe keynote speaker of the session is Janab Ataul Islam Abu, Assistant Professor, Department of MIS, University of Dhaka. In his talk, he is expected to shed light on the intellectual, moral, and practical roles of youth in facing the current challenges confronting the Ummah.\n\nThe program is being organized by United Muslim Ummah Youth Network (UMUYN) as part of its ongoing efforts to engage and empower Muslim youth through knowledge-based discussions and awareness programs.\n\nThe live broadcast will be available on https://www.facebook.com/UMUYN/. Organizers have invited students, youth, and concerned members of the community to join the session and benefit from the discussion.",
    "image": "/assets/news-02.jpg",
    "featured": true,
    "enabled": true,
    "category": "youth",
    "views": 1600,
    "likes": 380
  },
  {
    "id": 3,
    "title": "Tech Skills Training Now Open for Applications",
    "date": "2026-01-05",
    "author": "HR Department",
    "summary": "Free training program for aspiring tech professionals",
    "content": "We are offering free technology skills training covering web development, digital marketing, and data analysis. This program is open to all passionate learners aged 18-35.",
    "image": "/assets/news-03.jpg",
    "featured": false,
    "enabled": true,
    "category": "training",
    "views": 3450,
    "likes": 892
  },
  {
    "id": 4,
    "title": "Success Stories: Lives Changed Through Our Programs",
    "date": "2025-12-28",
    "author": "Success Stories Team",
    "summary": "Read how our initiatives have transformed communities",
    "content": "Meet the individuals whose lives have been positively impacted by our programs. From students who became entrepreneurs to families who found stability, these stories inspire us to do more.",
    "image": "/assets/news-04.jpg",
    "featured": false,
    "enabled": true,
    "category": "stories",
    "views": 1890,
    "likes": 523
  },
  {
    "id": 6,
    "title": "United Muslim Ummah Announces Historic 'World Peace March' from Moscow to Jerusalem",
    "date": "2026-01-28",
    "author": "United Muslim Ummah",
    "summary": "In a fervent bid to advocate for global harmony and call for an end to violence, the United Muslim Ummah has announced a major humanitarian initiative",
    "content": "In a fervent bid to advocate for global harmony and call for an end to violence, the United Muslim Ummah has announced a major humanitarian initiative titled the 'World Peace March.'\n\nThe march, described by organizers as a movement 'against war and the killing of innocent people,' is scheduled to span a significant route starting from Moscow and concluding in Jerusalem. This symbolic journey aims to unite voices across borders against the escalating conflicts that have plagued various regions of the world.\n\nThe campaign highlights the devastating impact of war, particularly on vulnerable populations. Graphic imagery released alongside the announcement depicts the harsh realities of conflict zones—showing the suffering of injured children and displaced families. The organizers emphasize that the primary goal is to demand an immediate halt to the bloodshed and to ensure safety for civilians caught in the crossfire.\n\nBy marching from Moscow to Jerusalem, the participants intend to send a powerful message to global leaders: humanity must prevail over conflict.",
    "image": "/assets/gallery-018.jpg",
    "featured": true,
    "enabled": true,
    "category": "peace",
    "views": 2200,
    "likes": 650
  }
]
